#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/AlirezaRahmani/GitHubAction-Terraform/runs/run-J5uYCs1VGqH3Ed1i

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
data.azurerm_resource_group.resource_group: Refreshing...
data.azurerm_client_config.current: Refreshing...
data.azurerm_client_config.current: Refresh complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMDJlNWY5Ny0xMjUzLTQxMTctOTAyOS00YTA5N2RhMzJiZjc7b2JqZWN0SWQ9ZDczYmIxMmItYmI5Zi00ODIyLWI4MGItMGJhYjE4OWJkMzkwO3N1YnNjcmlwdGlvbklkPTI1ZmVlZmQ3LTBjMTUtNDhlZi05ZDgyLWRmY2Y5N2YzNWI3NTt0ZW5hbnRJZD02NGRjNjllNC1kMDgzLTQ5ZmMtOTU2OS1lYmVjZTFkZDE0MDg=]
data.azurerm_resource_group.resource_group: Refresh complete after 0s [id=/subscriptions/25feefd7-0c15-48ef-9d82-dfcf97f35b75/resourceGroups/aro-rg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azapi_resource.aro_cluster will be created
  + resource "azapi_resource" "aro_cluster" {
      + body                      = (sensitive value)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus2"
      + name                      = "Alireza-Aro"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/25feefd7-0c15-48ef-9d82-dfcf97f35b75/resourceGroups/aro-rg"
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = {
          + "createdWith" = "Terraform"
          + "department"  = "Ops"
          + "environment" = "Development"
        }
      + type                      = "Microsoft.RedHatOpenShift/openShiftClusters@2022-04-01"
    }

  # azurerm_role_assignment.aro_cluster_service_principal_network_contributor will be created
  + resource "azurerm_role_assignment" "aro_cluster_service_principal_network_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.aro_resource_provider_service_principal_network_contributor will be created
  + resource "azurerm_role_assignment" "aro_resource_provider_service_principal_network_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_subnet.master_subnet will be created
  + resource "azurerm_subnet" "master_subnet" {
      + address_prefixes                               = [
          + "10.0.0.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "master-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = false
      + resource_group_name                            = "aro-rg"
      + service_endpoints                              = [
          + "Microsoft.ContainerRegistry",
        ]
      + virtual_network_name                           = "Alireza-VNet"
    }

  # azurerm_subnet.worker_subnet will be created
  + resource "azurerm_subnet" "worker_subnet" {
      + address_prefixes                               = [
          + "10.0.2.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "worker-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "aro-rg"
      + service_endpoints                              = [
          + "Microsoft.ContainerRegistry",
        ]
      + virtual_network_name                           = "Alireza-VNet"
    }

  # azurerm_virtual_network.virtual_network will be created
  + resource "azurerm_virtual_network" "virtual_network" {
      + address_space       = [
          + "10.0.0.0/22",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus2"
      + name                = "Alireza-VNet"
      + resource_group_name = "aro-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "createdWith" = "Terraform"
          + "department"  = "Ops"
          + "environment" = "Development"
        }
    }

  # random_string.resource_prefix will be created
  + resource "random_string" "resource_prefix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 7 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @Dexash, Action: `pull_request`*